Tekla Open API Reference for Tekla Structures 2025
Arc Methods
The Arc type exposes the following members.
Methods
Name | Description
Clone
 Returns a copy of itself
Equals(Object)
 Checks for equality with another arc
 (Overrides Object.Equals(Object).)
Equals(ICurve)
 Checks for equality with another curve
GetHashCode
 Get HashCode override
 (Overrides Object.GetHashCode().)
Top
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace